Revit 2026 API

# PipingSystemIsWellConnected Property

---

Indicates if the system is well connected or not.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsWellConnected { get; }
```
```vb
Public ReadOnly Property IsWellConnected As Boolean
	Get
```
```cpp
public:
property bool IsWellConnected {
	bool get ();
}
```
```fsharp
member IsWellConnected : bool with get
```

#### Property Value

Boolean

If the system is not well connected, parameters which need to be calculated are invalid.

#### Reference

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace